In [1]:
import pandas as pd
import numpy as np

In [2]:
(pd.__version__, np.__version__)

('0.20.2', '1.11.3')

# Basic Concepts of Series and DataFrame

pandas 的兩個主要資料結構為 Series 與 DataFrame。

Series 為一維，存放資料的 1. 值與 2. 其對應的 index。

index 可用來標註資料列所屬的組別，且可使用 index 篩選資料。更多說明可見[文件](http://pandas.pydata.org/pandas-docs/stable/indexing.html)。

In [3]:
s = pd.Series([1, 2, 4, 5])

In [4]:
s.values

array([1, 2, 4, 5])

In [5]:
s.index

RangeIndex(start=0, stop=4, step=1)

index 可以自訂。

In [6]:
s = pd.Series([1, 2, 4, 5], index=['a', 'b', 'b', 'c'])

In [7]:
s.index

Index(['a', 'b', 'b', 'c'], dtype='object')

使用 index 篩選資料。

In [8]:
s['b']

b    2
b    4
dtype: int64

Series 可以想成是一維的 ndarray，因此可使用 ndarray 的方式運算。

In [9]:
s[s > 2]

b    4
c    5
dtype: int64

In [10]:
s * 10

a    10
b    20
b    40
c    50
dtype: int64

In [11]:
np.sqrt(s)

a    1.000000
b    1.414214
b    2.000000
c    2.236068
dtype: float64

Series 可透過 dictionary 建立。

In [12]:
data = {'A': 20, 'B': 10, 'C': 20}
s = pd.Series(data)
s

A    20
B    10
C    20
dtype: int64

In [13]:
# index 參數可以決定順序
s = pd.Series(data, index=['D', 'A', 'C', 'B'])

In [14]:
# 因為 index 沒有 D 對應的值，故為 NaN
s

D     NaN
A    20.0
C    20.0
B    10.0
dtype: float64

`reindex()` 可以更新 index。

In [15]:
obj = pd.Series([1, 2, 3], index = ['a', 'b', 'c'])
obj

a    1
b    2
c    3
dtype: int64

In [16]:
obj.reindex(['b', 'c', 'd', 'a'])

b    2.0
c    3.0
d    NaN
a    1.0
dtype: float64

In [17]:
obj.reindex(['b', 'c', 'd', 'a'], fill_value='0')

b    2
c    3
d    0
a    1
dtype: object

In [18]:
obj = pd.Series(['a', 'b', 'c'], index=[0, 2, 4])
obj

# ffill stands for "forward fill"
obj.reindex(range(6), method='ffill')

0    a
1    a
2    b
3    b
4    c
5    c
dtype: object

不可直接更新 index 屬性，因其不可變 (immutable)。

In [159]:
obj.index[1] = 2

TypeError: Index does not support mutable operations

DataFrame 為二維，且每個欄位(column) 的型態可以不同 (Heterogeneous)。

使用 dictionary 建立 DataFrame。

In [20]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [21]:
# 使用 index 參數指定 index
frame2 = pd.DataFrame(data, 
                      columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [22]:
# dataFrame 的 dtype 為 object
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

`values` 屬性可回傳 2-d array

In [23]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan]], dtype=object)

# Basic Data Manipulations Functions

基本資料整理功能主要會有下列五項：
1. 取出欄位與刪除欄位 (Selecting and removing columns)
2. 新增欄位 (Adding new columns)
3. 篩選列資料與刪除列資料 (Filtering and deleting rows)
4. 排序 (Sorting Data)
5. 彙總資料 (Summarising data)

## Selecting Columns or Removing Columns

DataFrame 可用以下兩種方式取出欄位。

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data, 
                    columns=['year', 'state', 'pop', 'debt'], 
                    index=['one', 'two', 'three', 'four', 'five'])

In [25]:
# 1. by dic-like notation
frame['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [26]:
# 2. by attribute
frame.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

取出欄位後，可用 `=` 更新值。

In [27]:
frame['debt'] = np.arange(5.)
frame

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

使用 `drop()` 刪除欄位。

In [28]:
# 刪除欄位記得設定 axis=1
frame.drop(['year'], axis=1)

        state  pop  debt
one      Ohio  1.5   0.0
two      Ohio  1.7   1.0
three    Ohio  3.6   2.0
four   Nevada  2.4   3.0
five   Nevada  2.9   4.0

## Adding New Columns

新增欄位方式為使用 `=` 指定新欄位名稱，如下所示。

In [29]:
frame['tot_debt'] = frame['pop'] * frame['debt']
frame

       year   state  pop  debt  tot_debt
one    2000    Ohio  1.5   0.0       0.0
two    2001    Ohio  1.7   1.0       1.7
three  2002    Ohio  3.6   2.0       7.2
four   2001  Nevada  2.4   3.0       7.2
five   2002  Nevada  2.9   4.0      11.6

In [30]:
frame['state_Ohio'] = (frame['state'] == 'Ohio')
frame

       year   state  pop  debt  tot_debt  state_Ohio
one    2000    Ohio  1.5   0.0       0.0        True
two    2001    Ohio  1.7   1.0       1.7        True
three  2002    Ohio  3.6   2.0       7.2        True
four   2001  Nevada  2.4   3.0       7.2       False
five   2002  Nevada  2.9   4.0      11.6       False

## Filtering and Deleting Rows

透過 boolean Series 或 boolean DataFrame 篩選值。

In [31]:
frame['pop'] > 2

one      False
two      False
three     True
four      True
five      True
Name: pop, dtype: bool

In [32]:
frame[frame['pop'] > 2]

       year   state  pop  debt  tot_debt  state_Ohio
three  2002    Ohio  3.6   2.0       7.2        True
four   2001  Nevada  2.4   3.0       7.2       False
five   2002  Nevada  2.9   4.0      11.6       False

In [33]:
# the negation is ~
frame[(frame['pop'] > 2) & (~ frame['state_Ohio'])]

      year   state  pop  debt  tot_debt  state_Ohio
four  2001  Nevada  2.4   3.0       7.2       False
five  2002  Nevada  2.9   4.0      11.6       False

In [34]:
frame > 2

       year  state    pop   debt  tot_debt  state_Ohio
one    True   True  False  False     False       False
two    True   True  False  False     False       False
three  True   True   True  False      True       False
four   True   True   True   True      True       False
five   True   True   True   True      True       False

In [35]:
frame[frame > 2]

       year   state  pop  debt  tot_debt  state_Ohio
one    2000    Ohio  NaN   NaN       NaN         NaN
two    2001    Ohio  NaN   NaN       NaN         NaN
three  2002    Ohio  3.6   NaN       7.2         NaN
four   2001  Nevada  2.4   3.0       7.2         NaN
five   2002  Nevada  2.9   4.0      11.6         NaN

可使用 `isin()` 篩選值。`isin()` 回傳 boolean Series，表示值是否有符合條件，進而做到篩選值。

In [36]:
frame.state.isin(['Nevada'])

one      False
two      False
three    False
four      True
five      True
Name: state, dtype: bool

In [37]:
frame[frame.state.isin(['Nevada'])]

      year   state  pop  debt  tot_debt  state_Ohio
four  2001  Nevada  2.4   3.0       7.2       False
five  2002  Nevada  2.9   4.0      11.6       False

## Selecting Columns and Filtering Rows Simultaneosly

使用 `loc[]` 或 `iloc[]` 同時取出欄位與篩選列資料。
1. `loc[]` 是使用 index 或欄位的「名稱」(label) 進行篩選
2. `iloc[]` 是使用 index 或欄位的「位置」(position) 進行篩選，故只能使用整數

In [38]:
# 若有多個 indices 或欄位，需以 list 輸入
frame.loc[['one', 'two'], ['year', 'state']]

     year state
one  2000  Ohio
two  2001  Ohio

In [39]:
frame.iloc[0:2, 0:2]

     year state
one  2000  Ohio
two  2001  Ohio

註：`ix[]` 也是一個常見的取值方式，但其在 pandas 0.20.2 已 deprecated。可見[文件](http://pandas-docs.github.io/pandas-docs-travis/indexing.html#ix-indexer-is-deprecated)。

## Sorting Data

`sort_index()` 可針對 index 或欄位名稱進行排序。

In [40]:
frame.sort_index()

       year   state  pop  debt  tot_debt  state_Ohio
five   2002  Nevada  2.9   4.0      11.6       False
four   2001  Nevada  2.4   3.0       7.2       False
one    2000    Ohio  1.5   0.0       0.0        True
three  2002    Ohio  3.6   2.0       7.2        True
two    2001    Ohio  1.7   1.0       1.7        True

In [41]:
frame.sort_index(axis=1)

       debt  pop   state  state_Ohio  tot_debt  year
one     0.0  1.5    Ohio        True       0.0  2000
two     1.0  1.7    Ohio        True       1.7  2001
three   2.0  3.6    Ohio        True       7.2  2002
four    3.0  2.4  Nevada       False       7.2  2001
five    4.0  2.9  Nevada       False      11.6  2002

`sort_values()` 可指定要針對哪個 index 或欄位排序。

In [42]:
frame.sort_values(ascending=False, by="pop")

       year   state  pop  debt  tot_debt  state_Ohio
three  2002    Ohio  3.6   2.0       7.2        True
five   2002  Nevada  2.9   4.0      11.6       False
four   2001  Nevada  2.4   3.0       7.2       False
two    2001    Ohio  1.7   1.0       1.7        True
one    2000    Ohio  1.5   0.0       0.0        True

## Summarising Data

Numpy 的 universal functions (ufuncs) 可運作在 Dataframe。

In [43]:
np.mean(frame)

year          2001.20
pop              2.42
debt             2.00
tot_debt         5.54
state_Ohio       0.60
dtype: float64

透過 `apply()` 對 DataFrame 作自訂函數運算。

In [44]:
f = lambda x: x.max() - x.min()
frame[['pop', 'debt']].apply(f)

pop     2.1
debt    4.0
dtype: float64

`applymap()` 運作在 DataFrame 的每一元素。

In [45]:
f = lambda x: x * 10
dat = pd.DataFrame(np.random.rand(3, 2))
dat

          0         1
0  0.959702  0.824630
1  0.344084  0.561021
2  0.886448  0.870591

In [46]:
dat.applymap(f)

          0         1
0  9.597019  8.246299
1  3.440841  5.610206
2  8.864481  8.705905

可將彙整後結果指定為新欄位。

In [47]:
frame['pop_mean'] = np.mean(frame['pop'])
frame

       year   state  pop  debt  tot_debt  state_Ohio  pop_mean
one    2000    Ohio  1.5   0.0       0.0        True      2.42
two    2001    Ohio  1.7   1.0       1.7        True      2.42
three  2002    Ohio  3.6   2.0       7.2        True      2.42
four   2001  Nevada  2.4   3.0       7.2       False      2.42
five   2002  Nevada  2.9   4.0      11.6       False      2.42

DataFrame 物件有許多計算基本統計量的函數，清單可見[此處](https://pandas.pydata.org/pandas-docs/stable/basics.html#descriptive-statistics)。

In [48]:
# 基本統計量
frame.describe()

             year       pop      debt   tot_debt  pop_mean
count     5.00000  5.000000  5.000000   5.000000      5.00
mean   2001.20000  2.420000  2.000000   5.540000      2.42
std       0.83666  0.864292  1.581139   4.681666      0.00
min    2000.00000  1.500000  0.000000   0.000000      2.42
25%    2001.00000  1.700000  1.000000   1.700000      2.42
50%    2001.00000  2.400000  2.000000   7.200000      2.42
75%    2002.00000  2.900000  3.000000   7.200000      2.42
max    2002.00000  3.600000  4.000000  11.600000      2.42

In [49]:
frame.count()

year          5
state         5
pop           5
debt          5
tot_debt      5
state_Ohio    5
pop_mean      5
dtype: int64

### Summarising Data By Group

彙總資料時，有時會需要依組別分別進行計算，而不是值ㄐ例如分別依地區、性別計算平均值。

其操作流程基本上為 split-apply-combine。split 指的是透過某些欄位值，將資料進行分組。 apply 指的是將分組的資料進行函數轉換計算，例如加總、平均等。combine 是將計算結果合併。

如下所示，首先 df['data1'] 透過 key1 欄位將資料分組 (a 與 b)。接著透過 `mean()` 計算各組平均，最後再合併計算結果並回傳。

In [50]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5), 
                   'data2' : np.random.randn(5)})
df['data1'].groupby(df['key1']).mean()

key1
a   -0.359593
b    0.920734
Name: data1, dtype: float64

多個 keys 以 list 形式作為參數。

In [51]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.311173
      two    -0.456433
b     one     1.340112
      two     0.501355
Name: data1, dtype: float64

key 亦可以是 ndarray。但長度需與原 DataFrame 列 (row) 數相同。

In [52]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005   -0.456433
            2006    1.340112
Ohio        2005    0.767123
            2006   -1.655237
Name: data1, dtype: float64

DataFrame 可直接用欄位名稱進行 `GroupBy()`。

In [53]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.359593  0.086711
b     0.920734  0.198340

In [54]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.311173 -0.172833
     two  -0.456433  0.605798
b    one   1.340112 -0.851992
     two   0.501355  1.248672

使用 for 迴圈在組間迭代運算。

In [55]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  1.032892  0.658691    a  one
1 -0.456433  0.605798    a  two
4 -1.655237 -1.004357    a  one
b
      data1     data2 key1 key2
2  1.340112 -0.851992    b  one
3  0.501355  1.248672    b  two

In [56]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0  1.032892  0.658691    a  one
4 -1.655237 -1.004357    a  one
a two
      data1     data2 key1 key2
1 -0.456433  0.605798    a  two
b one
      data1     data2 key1 key2
2  1.340112 -0.851992    b  one
b two
      data1     data2 key1 key2
3  0.501355  1.248672    b  two

可將 `groupby()` 結果透過 dict(list(...) 轉換成 dictionary。

In [57]:
pieces = dict(list(df.groupby('key1')))
pieces['a']

      data1     data2 key1 key2
0  1.032892  0.658691    a  one
1 -0.456433  0.605798    a  two
4 -1.655237 -1.004357    a  one

`groupby()` 預設為 axis=0，可加以設定。

In [58]:
grouped = df.groupby(df.dtypes, axis=1)
dict(list(grouped))

{dtype('float64'):       data1     data2
 0  1.032892  0.658691
 1 -0.456433  0.605798
 2  1.340112 -0.851992
 3  0.501355  1.248672
 4 -1.655237 -1.004357, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

透過 dictionary 進行 `groupby()`。

In [59]:
people = pd.DataFrame(np.random.randn(5, 5), 
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.iloc[2:3, 1:3] = np.nan

In [60]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [61]:
people.groupby(mapping, axis=1).mean()

            blue       red
Joe    -0.199956 -0.476703
Steve   0.061371 -0.615392
Wes     0.214749  0.727985
Jim    -0.611939  0.617799
Travis  0.529379  0.030335

In [62]:
map_series = pd.Series(mapping)
people.groupby(map_series, axis=1).mean()

            blue       red
Joe    -0.199956 -0.476703
Steve   0.061371 -0.615392
Wes     0.214749  0.727985
Jim    -0.611939  0.617799
Travis  0.529379  0.030335

透過其他函數進行 `groupby()`。

透過 index 的字串長度建立 groups，並計算平均數。

In [63]:
people.groupby(len).mean()

          a         b         c         d         e
3  0.083048  0.525862  0.108666 -0.542125  0.192797
5  0.249666 -0.841301  0.534474 -0.411732 -1.254542
6  0.406633 -0.165002  0.644995  0.413763 -0.150626

當 DataFrame 有多個 indices 時，使用 level 參數進行 `groupby()`。

In [64]:
# 使用 MultiIndex 設定多個 indices
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],[1, 3, 5, 1, 3]], names=['cty', 'tenor'])
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [65]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.528250  0.381775  0.779393  1.161260 -0.722335
1     -0.582855 -0.631706  1.933528 -1.434739  0.900745
2      0.768009  0.542980 -0.600239 -0.678131 -1.929547
3     -0.827298  0.178166 -0.747750  2.455253  1.066810

In [66]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [67]:
hier_df.groupby(level='tenor', axis=1).count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

若要使用自訂彙總函數，可使用 `groupby()` 與 `agg()` 完成。

In [68]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
df.groupby('key1').agg(peak_to_peak)

         data1     data2
key1
a     2.688129  1.663048
b     0.838756  2.100664

`agg()` 亦可使用內建統計彙總函數。

In [69]:
# get the tip dataset
url = "https://raw.githubusercontent.com/wesm/pydata-book/master/ch08/tips.csv"
tips = pd.read_csv(url)
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [70]:
grouped = tips.groupby(['sex', 'smoker'])
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [71]:
# 使用多個彙總函數
grouped_pct.agg((['mean', 'std', peak_to_peak]))

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [72]:
# 針對不同欄位使用不同彙總函數
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [73]:
# 使用 dictionary 針對不同欄位使用不同彙總函數
grouped.agg({'tip' : np.max, 'size' : 'sum'})

                tip  size
sex    smoker
Female No       5.2   140
       Yes      6.5    74
Male   No       9.0   263
       Yes     10.0   150

In [74]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'], 'size' : 'sum'})

                tip_pct                               size
                    min       max      mean       std  sum
sex    smoker
Female No      0.056797  0.252672  0.156921  0.036421  140
       Yes     0.056433  0.416667  0.182150  0.071595   74
Male   No      0.071804  0.291990  0.160669  0.041849  263
       Yes     0.035638  0.710345  0.152771  0.090588  150

透過 `as_index=False` 參數可以將 index 變成欄位變數。

In [75]:
tips.groupby(['sex', 'smoker'], as_index=False).mean()

      sex smoker  total_bill       tip      size   tip_pct
0  Female     No   18.105185  2.773519  2.592593  0.156921
1  Female    Yes   17.977879  2.931515  2.242424  0.182150
2    Male     No   19.791237  3.113402  2.711340  0.160669
3    Male    Yes   22.284500  3.051167  2.500000  0.152771

`transform()` 亦是分組計算統計量。但結果與 `agg()` 不同，如下例。

In [76]:
key = ['one', 'two', 'one', 'two', 'one']
people

               a         b         c         d         e
Joe    -0.944942 -0.797695  0.271512 -0.671424  0.312528
Steve   0.249666 -0.841301  0.534474 -0.411732 -1.254542
Wes     1.679837       NaN       NaN  0.214749 -0.223868
Jim    -0.485752  1.849418 -0.054179 -1.169699  0.489730
Travis  0.406633 -0.165002  0.644995  0.413763 -0.150626

In [77]:
people.groupby(key).agg('mean')

            a         b         c         d         e
one  0.380509 -0.481348  0.458253 -0.014304 -0.020655
two -0.118043  0.504059  0.240147 -0.790716 -0.382406

In [78]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe     0.380509 -0.481348  0.458253 -0.014304 -0.020655
Steve  -0.118043  0.504059  0.240147 -0.790716 -0.382406
Wes     0.380509 -0.481348  0.458253 -0.014304 -0.020655
Jim    -0.118043  0.504059  0.240147 -0.790716 -0.382406
Travis  0.380509 -0.481348  0.458253 -0.014304 -0.020655

透過 `groupby()` 搭配 `apply()` 分組進行函數(不侷限於彙總函數)運算。

In [79]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [80]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

設定 group_keys=False 可不回傳 `groupby()` 的 key。

In [81]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip     sex smoker   day    time  size   tip_pct
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

## Constructing Pivot Tables

Pivot table 是另一種展示彙總資料的方式，可藉由 `pivot_tables` 建立。

In [82]:
# index 參數設定 pivot table 的列分組欄位；aggfunc 參數設定彙總函數 (預設為 mean)
tips.pivot_table(index = ['sex', 'smoker'], aggfunc='mean')

                   size       tip   tip_pct  total_bill
sex    smoker
Female No      2.592593  2.773519  0.156921   18.105185
       Yes     2.242424  2.931515  0.182150   17.977879
Male   No      2.711340  3.113402  0.160669   19.791237
       Yes     2.500000  3.051167  0.152771   22.284500

In [83]:
# column 參數設定 pivot table 的欄分組欄位
tips.pivot_table(['tip_pct', 'size'], index=['sex', 'day'], columns= 'smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
sex    day
Female Fri   2.500000  2.000000  0.165296  0.209129
       Sat   2.307692  2.200000  0.147993  0.163817
       Sun   3.071429  2.500000  0.165710  0.237075
       Thur  2.480000  2.428571  0.155971  0.163073
Male   Fri   2.000000  2.125000  0.138005  0.144730
       Sat   2.656250  2.629630  0.162132  0.139067
       Sun   2.883721  2.600000  0.158291  0.173964
       Thur  2.500000  2.300000  0.165706  0.164417

In [84]:
# margins=True 參數可加入小計
tips.pivot_table(['tip_pct', 'size'],
                 index=['sex', 'day'],
                 columns='smoker', 
                 margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
sex    day
Female Fri   2.500000  2.000000  2.111111  0.165296  0.209129  0.199388
       Sat   2.307692  2.200000  2.250000  0.147993  0.163817  0.156470
       Sun   3.071429  2.500000  2.944444  0.165710  0.237075  0.181569
       Thur  2.480000  2.428571  2.468750  0.155971  0.163073  0.157525
Male   Fri   2.000000  2.125000  2.100000  0.138005  0.144730  0.143385
       Sat   2.656250  2.629630  2.644068  0.162132  0.139067  0.151577
       Sun   2.883721  2.600000  2.810345  0.158291  0.173964  0.162344
       Thur  2.500000  2.300000  2.433333  0.165706  0.164417  0.165276
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [85]:
# 使用 aggfunc 參數設定不同彙總函數
tips.pivot_table('tip_pct', 
                 index=['sex', 'smoker'], 
                 columns='day',
                 aggfunc='count', 
                 margins=True)

day             Fri   Sat   Sun  Thur    All
sex    smoker
Female No       2.0  13.0  14.0  25.0   54.0
       Yes      7.0  15.0   4.0   7.0   33.0
Male   No       2.0  32.0  43.0  20.0   97.0
       Yes      8.0  27.0  15.0  10.0   60.0
All            19.0  87.0  76.0  62.0  244.0

# Merging and Concatenating DataFrames

前段已說明如何使用 pandas 進行單一 DataFrame 的資料整理。而本段將說明如何合併兩個 DataFrames。

## Merging DataFrames

Merge (或 Join) 為兩個資料集透過共有的欄位 (稱為 key)，將欄位進行合併。而合併方式的細節可見[此處](http://www.sql-join.com/sql-join-types/)。

`merge()` 是以 how 參數調整合併方式，預設為 inner join；並透過 on 參數設定 key 欄位。

In [86]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [87]:
pd.merge(df1, df2, how = "inner", on = "key")

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

若兩個 DataFrames 的 key 欄位名稱不同，則可以透過 lkey 和 rkey 結合。

In [88]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

因結合時預設為 inner join，故結合後的 DataFrame 只會出現兩個 key 欄位都有的值。若改為 outer join，則會將兩個 key 欄位出現過的值都列出來，若另一個 key 欄位沒有的值就以 NaN 表示

In [89]:
pd.merge(df1, df2, how = "outer")

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

left join 會將第一個的 DataFrame 的 key 欄位所有值都列出來。

In [90]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'], 'data2': range(5)})

In [91]:
pd.merge(df1, df2, on='key', how='left')

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
5       2   a    2.0
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

如果 key 欄位個數在兩個或兩個以上，則用 list 定義之。

In [92]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'], 'key2': ['one', 'two', 'one'], 
                     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'], 'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

In [93]:
pd.merge(left, right, on=['key1', 'key2'], how='inner')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

若兩個 DataFrames 合併時，若非 key 欄位名稱相同，名稱可用 suffixes 參數區分。

In [94]:
# 使用 suffixes 區分兩個 DataFrames 的 key2 欄位
pd.merge(left, right, on='key1', suffixes=("_left", "_right"))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

key 也可以是 DataFrame 的 index，透過 left_index=True 或 right_index=True 參數設定。

In [95]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

多個 keys 的範例。

In [96]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
                   'key2': [2000, 2001, 2002, 2001, 2002],
                   'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                   index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                          [2001, 2000, 2000, 2000, 2001, 2002]],
                   columns=['event1', 'event2'])
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1

Index-on-index merging 的範例。

In [97]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], 
                  index=['a', 'c', 'e'], columns=['Ohio', 'Nevada'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                   index=['b', 'c', 'd', 'e'], columns=['Missouri', 'Alabama'])
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

DataFrame 可透過 `join()` 做到 index-on-index merging。兩個 DataFrames 的欄位名稱不能重複，除非透過 lsuffix 或 rsuffix 參數區分。

In [98]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [99]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

## Concatenating DataFrames Along an Axis

另一個結合的方式為 concatenate，也就是將兩個 DataFrames 直接進行列資料或欄位的合併。

pandas 的 concatenate 函數為 `concat()`。 以下的例子說明 axis 設定不同的影響。

In [100]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [101]:
pd.concat([s1, s2, s3], axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

可透過 join 參數調整 index 結合的規則，預設為 outer，所以會是聯集。若調整為 inner 則是交集。 另也可透過 join_axes 參數指定要結合的 index。

In [102]:
s4 = pd.concat([s1 * 5, s3])
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [103]:
pd.concat([s1, s4], axis=1, join = "inner")

   0  1
a  0  0
b  1  5

In [104]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

若要結合後的 DataFrame 註明原本各個 DataFrame，可使用 keys 參數建立 index。

In [105]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['three', 'four'])
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

另也可以用 dictionary 代替 keys 參數。

In [106]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

如果 DataFrames 的 index 無意義(流水號)，可用 ignore_index=True 忽略之。

In [107]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -1.260666 -0.184615 -0.702212  0.901343
1  1.426200  0.896931  0.625170  1.374220
2 -0.775324 -1.962683  0.908125  0.724158
3 -0.571334  0.170243       NaN -0.224268
4 -0.780158 -0.612393       NaN  2.121664

## DataFrame 四則運算與 index 結合規則

當兩個 DataFrames 做四則運算時，index 與欄位會以聯集方式組合成新的 DataFrame。

In [108]:
s1 + s2

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [109]:
d1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                  columns=list('abc'),
                  index=['A', 'B', 'C'])
d2 = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                  columns=list('bcde'),
                  index=['A', 'B', 'C', 'E'])

In [110]:
d1 + d2

    a     b     c   d   e
A NaN   1.0   3.0 NaN NaN
B NaN   8.0  10.0 NaN NaN
C NaN  15.0  17.0 NaN NaN
E NaN   NaN   NaN NaN NaN

In [111]:
# 設定 fill_value = 0， NaN 會用兩個 DataFrames 有值的一個填補
d1.add(d2, fill_value=0)

     a     b     c     d     e
A  0.0   1.0   3.0   2.0   3.0
B  3.0   8.0  10.0   6.0   7.0
C  6.0  15.0  17.0  10.0  11.0
E  NaN  12.0  13.0  14.0  15.0

In [112]:
d1.mul(d2, fill_value=0)

     a     b     c    d    e
A  0.0   0.0   2.0  0.0  0.0
B  0.0  16.0  25.0  0.0  0.0
C  0.0  56.0  72.0  0.0  0.0
E  NaN   0.0   0.0  0.0  0.0

# More Data Manipulation Techniques

## Dealing with Missing Values

`isnull()` 回傳 boolean Series，表示值是否為遺失值 (NaN/None)。

In [113]:
obj = pd.Series(['A', 'B', np.nan, 'C'])

In [114]:
obj.isnull()

0    False
1    False
2     True
3    False
dtype: bool

`dropna()` 可刪除遺漏值。

In [115]:
obj.dropna()

0    A
1    B
3    C
dtype: object

In [116]:
data = pd.DataFrame([[1, 2, 3], 
                     [4, np.nan, np.nan], 
                     [np.nan, np.nan, np.nan]])

In [117]:
# 設定 how='all' 只會刪除所有值皆為遺失值的列
data.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  NaN

`fillna()` 可以透過不同方式填補遺漏值。

In [118]:
data.fillna(value=0)

     0    1    2
0  1.0  2.0  3.0
1  4.0  0.0  0.0
2  0.0  0.0  0.0

In [119]:
# forward fill
data.fillna(method="ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  3.0
2  4.0  2.0  3.0

In [120]:
data.fillna(method="ffill", limit=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  3.0
2  4.0  NaN  NaN

## Removing Duplicates

可用 `drop_duplicates()`去除重複列資料。

In [121]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4, 
                  'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [122]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

`drop_duplicates()` 預設是回傳第一個刪除其他重複列，透過 keep='last' 可回傳最後一個重複列刪除其他列。

In [123]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
1  one   1
2  one   2
4  two   3
6  two   4

## Reshaping
以 index 或欄位做行列轉換。

### Reshaping on Index
1. `stack()`: 將 column index 變成 row index
2. `unstack()`: 將 row index 變成 column index

In [124]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)), 
                 index=pd.Index(['Ohio', 'Colorado'], name='state'), 
                 columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [125]:
data.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [126]:
data.unstack()

number  state
one     Ohio        0
        Colorado    3
two     Ohio        1
        Colorado    4
three   Ohio        2
        Colorado    5
dtype: int64

`stack()` 和 `unstack()` 可以指定變數。

In [127]:
result = data.stack()
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

`stack()` 和 `unstack()` 的過程中可能會產生 NaN 值(因為原資料在某些 index 下沒有值)，可透過 dropna = False 保留。

In [128]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [129]:
data2.unstack().stack(dropna = False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

### Reshaping on Columns
`melt()` 可將欄位轉變成列值。value_vars 參數為要轉換成列值的欄位。

In [130]:
data = pd.DataFrame({'id':{0: 1, 1: 2, 2: 3},
                    'A': {0: 100, 1: 200, 2: 300},
                    'B': {0: 200, 1: 300, 2: 400},
                    'C': {0: 500, 1: 100, 2: 200}})
data

     A    B    C  id
0  100  200  500   1
1  200  300  100   2
2  300  400  200   3

In [131]:
data.melt(id_vars=['id'], value_vars=['A', 'B', 'C'])

   id variable  value
0   1        A    100
1   2        A    200
2   3        A    300
3   1        B    200
4   2        B    300
5   3        B    400
6   1        C    500
7   2        C    100
8   3        C    200

`pivot()` 可將列值轉為 Column indices。

In [132]:
melt_data = data.melt(id_vars=['id'], value_vars=['A', 'B', 'C'])
pivoted_data = melt_data.pivot(index='id', columns='variable', values='value')
pivoted_data

variable    A    B    C
id
1         100  200  500
2         200  300  100
3         300  400  200

In [133]:
pivoted_data.reset_index(level=0, inplace=True)
pivoted_data

variable  id    A    B    C
0          1  100  200  500
1          2  200  300  100
2          3  300  400  200

## Transforming Data Using a Function or Mapping
可以透過 `map()` 對應產生新欄位。

In [134]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 
                           'Bacon', 'pastrami', 'honey ham','nova lox'],
                  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [135]:
meat_to_animal = { 'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 
                  'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

In [136]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## Replacing Values
`replace()` 可以用新的值取代原有值。

In [137]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [138]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [139]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [140]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes
重新命名 Index 名稱可透過對 df.index 進行轉換或 `rename()` 完成。

In [141]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                 index=['Ohio', 'Colorado', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [142]:
data.index = data.index.map(str.upper)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [143]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

`rename()` 可以搭配 `map()` 重新命名。

In [144]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [145]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

## Discretization and Binning
數值區間化可透過 `cut()` 達成，通常可用在計數與繪製長條圖 (bar plot)。預設為開閉區間。

In [146]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [147]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

設定參數 right=False 將回傳閉開區間。

In [148]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

可透過 labels 參數設定區間名稱。

In [149]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

若 bin 參數為整數，則區間等分為此整數。

In [150]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.75, 0.97], (0.75, 0.97], (0.3, 0.52], (0.3, 0.52], (0.75, 0.97], ..., (0.3, 0.52], (0.078, 0.3], (0.75, 0.97], (0.52, 0.75], (0.75, 0.97]]
Length: 20
Categories (4, interval[float64]): [(0.078, 0.3] < (0.3, 0.52] < (0.52, 0.75] < (0.75, 0.97]]

若要透過百分位數等分，則用 `pd.qcut()`。

In [151]:
cats = pd.qcut(data, 4)
cats.value_counts()

(0.078, 0.352]    5
(0.352, 0.569]    5
(0.569, 0.847]    5
(0.847, 0.969]    5
dtype: int64

百分位數區間亦可自訂。

In [152]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.569, 0.946], (0.569, 0.946], (0.23, 0.569], (0.23, 0.569], (0.569, 0.946], ..., (0.23, 0.569], (0.078, 0.23], (0.569, 0.946], (0.569, 0.946], (0.946, 0.969]]
Length: 20
Categories (4, interval[float64]): [(0.078, 0.23] < (0.23, 0.569] < (0.569, 0.946] < (0.946, 0.969]]

## Permutation and Random Sampling
將資料隨機排序可透過 `np.random.permutation()` 完成。

In [153]:
df = pd.DataFrame(np.arange(5 * 4).reshape(5, 4))
sampler = np.random.permutation(5)
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19

抽樣可透過 `np.random.permutation()` 搭配 `take()` 完成。

In [154]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11

如果進行抽後放回式抽樣，可透過 `np.random.randint()` 完成。

In [155]:
bag = np.array([5, 7, -1, 6, 4])
sampler = np.random.randint(0, len(bag), size=10)
bag.take(sampler)

array([ 4,  4,  5, -1,  6, -1, -1,  6,  4,  5])

## Computing Indicator/Dummy Variables
產生虛擬變數可透過 `pd.get_dummies()` 完成。

In [156]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [157]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

`pd.get_dummies()` 搭配 `cut()`。

In [158]:
values = np.random.rand(10)
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           0           0           1           0           0
3           0           0           1           0           0
4           0           1           0           0           0
5           0           1           0           0           0
6           0           0           0           1           0
7           0           0           0           0           1
8           0           1           0           0           0
9           0           0           0           0           1